# "Кинотеатр"
# X мальчиков и Y девочек пошли в кинотеатр и купили билеты на подряд идущие места в одном ряду.
# Напишите программу, которая выдаст, как нужно сесть мальчикам и девочкам, чтобы рядом с каждым мальчиком
# сидела хотя бы одна девочка, а рядом с каждой девочкой — хотя бы один мальчик.
#
# На вход подаются два числа - кол-во мальчиков X и кол-во девочек Y.
# В ответе выведите какую-нибудь строку, в которой будет ровно X символов “B” (обозначающих мальчиков)
# и Y символов “G” (обозначающих девочек), удовлетворяющую условию задачи. Пробелы между символами выводить не нужно.
# Если рассадить мальчиков и девочек согласно условию задачи невозможно, выведите строку “Нет решения”.
x = int(input('Введите кол-во мальчиков'))
y = int(input('Введте кол-во девочек'))
i=1
text=''
if x>2*y or y>2*x:
    print('Нет решения')
else:
    if x>=y:
        while i<=(x-y):
            text+='BGB'
            i+=1
        i=1
        while i<=(y-(x-y)):
            text+='BG'
            i+=1
    else:
        while i<=(y-x):
            text+='GBG'
            i+=1
        i=1
        while i<=(x-(y-x)):
            text+='GB'
            i+=1
    print(text)