# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.
numbers=[-10,9,-8,7,6,-5,4,3]
sum=0
for number in numbers:
    sum+=int(number)
print(sum)
