# Даны координаты трех точек (xa; ya) (xb; yb) (xc; yc), если соединить эти точки отрезками
# и получится треугольник, то нужно найти его периметр и площадь.
# Если по заданным точкам треугольник построить нельзя, выведите соответствующее сообщение.
# Подсказка: для нахождения площади используйте Теорему Герона

def distance(x1, y1, x2, y2):
    # TODO: your code here
    return ((y2 - y1) ** 2 + (x1 - x2) ** 2) ** 0.5
    pass


def S_and_P(p1,p2,p3):
    r1 = distance(p1[0], p1[1], p2[0], p2[1])
    r2 = distance(p1[0], p1[1], p3[0], p3[1])
    r3 = distance(p3[0], p3[1], p2[0], p2[1])
    if r1+r2>r3 and r1+r3>r2 and r2+r3>r1:
        p=r1+r2+r3
        print(f'Периметр={p}')
        p/=2
        s=(p*(p-r1)*(p-r2)*(p-r3))**0.5
        print(f'Площадь={s}')
    else:
        print('Нельзя построить')
    return 0
S_and_P((10, 12), (14, 18), (12, 12))
# Не забудьте протестировать вашу функцию
