# Даны номер месяца и номер года. Найдите сколько дней в этом месяце.
# При вводе неверного номера месяца или некорректного значения программа должна сообщить об ошибке
# и попросить ввести корректные данные. Также необходимо учесть високосный или не високосный год.
# Алгоритм проверки на високосный год оформите в виде отдельной функции.
#
# Входная строка содержит два целых числа – номер месяца (возможно, неправильный) и номер года.
# Даны номер месяца и номер года. Найдите сколько дней в этом месяце.
# При вводе неверного номера месяца или некорректного значения программа должна сообщить об ошибке
# и попросить ввести корректные данные. Также необходимо учесть високосный или не високосный год.
# Алгоритм проверки на високосный год оформите в виде отдельной функции.
#
# Входная строка содержит два целых числа – номер месяца (возможно, неправильный) и номер года.
def leap_year(year):
    if year % 4 != 0 or (year % 100 == 0 and year % 400 != 0):
        return False
    return True


long_month = [1, 3, 5, 7, 8, 10, 12]
short_month = [4, 6, 9, 11]
while True:
    in_data = input('Введите месяц и год цифрами через пробел \n')
    data = in_data.split()
    try:
        month = int(data[0])
        year = int(data[1])
        if month in long_month:
            print(31)
            break
        elif month in short_month:
            print(30)
            break
        elif month == 2 and leap_year(year):
            print(29)
            break
        elif month == 2:
            print(28)
            break
    except (ValueError, TypeError, NameError):
        print('Введите данные корректно')

