# Дана строка из пяти целых чисел, разделенных пробелом.
# Пример входных данных: "2 12 -45 7 10"
# Напишите программу, которая находит среди них минимальное положительное число.
# Если таких чисел несколько - вывести любое из них.

# При решении задачи требуется учесть формат входных данных.
# Если входные данные некорректные, сообщить об этом.
# Дана строка из пяти целых чисел, разделенных пробелом.
# Пример входных данных: "2 12 -45 7 10"
# Напишите программу, которая находит среди них минимальное положительное число.
# Если таких чисел несколько - вывести любое из них.

# При решении задачи требуется учесть формат входных данных.
# Если входные данные некорректные, сообщить об этом.
while True:
    data_ar=[]
    in_data = input('Введите 5 челых числе через пробел \n')
    data = in_data.split()
    try:
        for d in data:
            data_ar.append(int(d))
        if len(data_ar) == 5:
            break
        else:
            raise ValueError
    except (TypeError, ValueError):
        print('Введите корретные данные!')

print(min(data_ar))
