# Вывод символов по диагоналям
# Даны сторона квадрата. Вывести его диагонали символами #.
# Формат входных данных: На вход программе одно целое число a (2<a≤30) - сторона квадрата.
# Формат выходных данных: Требуется вывести диагонали символами # (см. примеры)
# Примеры:
# a = 6
#    #
 #  #
  ##
  ##
 #  #
#    #

# a = 3
# #
 #
# #


# TODO: your code here
a = int(input("Введите номер сторону квадрата: "))
i=j=0
string=""
while i<a:
    while j<a:
        if j==i or j==((a-1)-i):
            string+="#"
        else:
            string+=" "
        j+=1
    print(string)
    i+=1
    string=""
    j=0
