# Два натуральных числа называются дружественными, если каждое из них равно сумме всех натуральных делителей другого
# (само число при этом не рассматривается в качестве собственного делителя).
# Необходимо найти все пары натуральных дружественных чисел (не равных друг другу),
# оба числа в которых меньше вводимого с клавиатуры числа N.
# Дано натуральное число n, требуется проверить его на простоту.

# Формат входных данных: Вводится одно целое число N (1≤N≤10000).
# Формат выходных данных: Требуется вывести все пары дружественных чисел,
# удовлетворяющие условию задачи. Пары можно выводить в любом порядке.

# Пример:
# Входные данные
# 300
# Выходные данные
#
# 220 284
# 284 220

# TODO: your code here
N = int(input("Введите число от 1 до 10000:"))
i=0
while i<=N:
   i+=1
   k=n=0
   x=j=1
   while x<i:
       if i%x==0:
           k+=x
       x+=1
   while j<k:
        if k%j==0:
           n+=j
        j+=1
   if i==n and i<k:
       print(i,k)
