# Дан файл ("data/fruits.txt") со списком фруктов.
# Записать в новые файлы все фрукты, начинающиеся с определенной буквы.
# Т.е. в одном файле будут все фрукты на букву “А”, во втором на “Б” и т.д.
# Файлы назвать соответственно.
# Пример имен файлов: fruits_А.txt, fruits_Б.txt, fruits_В.txt ….
# Важно! Обратите внимание, что нет фруктов, начинающихся с некоторых букв.
# Напишите универсальный код, который будет работать с любым списком фруктов и
# распределять по файлам в зависимости от первых букв, имеющихся в списке фруктов.
# Подсказка:
# Чтобы получить список больших букв русского алфавита:
# print(list(map(chr, range(ord('А'), ord('Я')+1))))
from itertools import groupby
with open('data/fruits.txt', encoding='utf-8') as input_file:
    for liter, data in groupby(input_file.readlines(), key=lambda liter: liter[0]):
        if liter != '\n':
            output_file = 'data/fruit_{}.txt'.format(liter)
            with open(output_file, 'a') as out:
                for x in data:
                    out.write(x)
