# Дан размер стороны квадрата. Вывести его стороны символами #.
# Формат входных данных
# На вход программе одно целое число a (2<a≤30) - сторона квадрата.
# Формат выходных данных
# Требуется вывести диагонали символами # (см. пример)

# Пример:
# Входные данные
# 6
# Выходные данные
######
#    #
#    #
#    #
#    #
######
a = int(input("Введите номер сторону квадрата: "))
i=j=0
string=""
while i<a:
    while j<a:
        if i==0 or i==(a-1) or j==0 or j==(a-1):
            string+="#"
        else:
            string+=" "
        j+=1
    print(string)
    i+=1
    string=""
    j=0
