# Дан список, заполненный произвольными целыми числами, получите новый список,
# элементами которого будут квадратные корни элементов исходного списка,
# но только если результаты извлечения корня не имеют десятичной части и
# если такой корень вообще можно извлечь
# Пример:
# Дано: [2, -5, 8, 9, -25, 25, 4]
# Результат: [3, 5, 2]
source_array = [2, -5, 8, 9, -25, 25, 4]
final_array = []
for el in source_array:
    if el > 0 and (el ** 0.5).is_integer():
        final_array.append(int(el ** 0.5))
print(final_array)
